def z1():
    s = [1, 3, 5, 10, 15]
    if int(input()) in s:
        print('Поздравляю, Вы угадали число!')
    else:
        print('Нет такого числа!')

def z2():
    s = [1, 2, 1, 3, 5]
    a = []
    for i in s:
        if s.count(i) > 1:
            a.append(i)
    print(set(a))

def z3():
    s = ('понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота', 'воскресенье')
    a = int(input('Сколько выходных на неделе вы хотите?'))
    print('Ваши выходные:', print(s[-a:]))
    print('Рабочие:', s[:len(s) - a])


def z4():
    a = ['Иванова', 'Коршунова', 'Шарипова', 'Воробьёва']
    b = ['Гончаренко', 'Лебедь', 'Дементьева', 'Филимонова']

    s = ('Иванова', 'Коршунова', 'Дементьева', 'Филимонова')
    print(a)
    print(b)
    print(s, len(s))
    print(sorted(s))
    if 'Иванова' in s:
        print('yes', s.count('Иванова'))
    else:
        print('no')

print(z1(), z2(), z3(), z4())