import random
def z1():
    s = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                     "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                     "Северная Македония": "Скопье", "Сербия": "Белград"}

    print(s['Белоруссия'])
    for i in sorted(s):
        print(i, '-', s[i])

def z2():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }
    s = input('Введите слово ')
    sum = 0

    for i in s:
        sum += alph[i]

    print(sum)

def z3():
    st = ['Иванова', 'Коршунова', 'Шарипова', 'Воробьёва']
    l = ['английский', 'китайский', 'японский']
    s = {}
    for i in st:
        c = random.randint(0, 2)
        s[i] = l[c]

    print(s)
    print(sorted(l))

    for i in s:
        if s[i] == 'китайский':
            print(i)

z1()
z2()
z3()






